; domain
(define (domain typed-sokoban)
(:requirements :typing)
(:types LOC DIR BOX)
(:predicates 
             (at-robot ?l - LOC)
             (at ?o - BOX ?l - LOC)
             (adjacent ?l1 - LOC ?l2 - LOC ?d - DIR) 
             (clear ?l - LOC)
)


(:action move
:parameters (?from - LOC ?to - LOC ?dir - DIR)
:precondition (and (clear ?to) (at-robot ?from) (adjacent ?from ?to ?dir))
:effect (and (at-robot ?to) (not (at-robot ?from)))
)
             

(:action push
:parameters  (?rloc - LOC ?bloc - LOC ?floc - LOC ?dir - DIR ?b - BOX)
:precondition (and (at-robot ?rloc) (at ?b ?bloc) (clear ?floc)
	           (adjacent ?rloc ?bloc ?dir) (adjacent ?bloc ?floc ?dir))

:effect (and (at-robot ?bloc) (at ?b ?floc) (clear ?bloc)
             (not (at-robot ?rloc)) (not (at ?b ?bloc)) (not (clear ?floc)))
)
)

; problem
;In guarantee_solution():
;Planning path: 0
;In plan_path():
;In put_box: 
;length of path: 5
;Planning path: 1
;In plan_path():

;Failed to generate a solvable instance... trying again: 

;clearing memory: 

;In guarantee_solution():
;Planning path: 0
;In plan_path():
;In put_box: 
;length of path: 5
;Planning path: 1
;In plan_path():
;In put_box: 
;length of path: 8
;In set_wall_mask(): 
;In clear_box_neighborhood(): 
;In enforce_direction_constraints(): 
;In setup_walls(): 
;Grid: 

; 8 8 3 8 8 
; 8 2 8 8 8 
; 0 8 8 8 8 
; 8 8 2 3 1 
; 8 8 8 3 1 

;Wall mask: 

; 0 0 1 0 0 
; 0 0 0 0 0 
; 0 0 0 0 0 
; 0 0 0 0 0 
; 0 0 0 0 0 




(define (problem typed-sokoban-grid5-boxes2-walls3)
(:domain typed-sokoban)
(:objects 
        up down left right - DIR
        box0 box1 - BOX
        f0-0f f0-1f f0-2f f0-3f f0-4f 
        f1-0f f1-1f f1-2f f1-3f f1-4f 
        f2-0f f2-1f f2-2f f2-3f f2-4f 
        f3-0f f3-1f f3-2f f3-3f f3-4f 
        f4-0f f4-1f f4-2f f4-3f f4-4f  - LOC
)
(:init
(adjacent f0-0f f0-1f right)
(adjacent f0-0f f1-0f down)
(adjacent f0-1f f0-0f left)
(adjacent f0-1f f0-2f right)
(adjacent f0-1f f1-1f down)
(adjacent f0-2f f0-1f left)
(adjacent f0-2f f0-3f right)
(adjacent f0-2f f1-2f down)
(adjacent f0-3f f0-2f left)
(adjacent f0-3f f0-4f right)
(adjacent f0-3f f1-3f down)
(adjacent f0-4f f0-3f left)
(adjacent f0-4f f1-4f down)
(adjacent f1-0f f1-1f right)
(adjacent f1-0f f0-0f up)
(adjacent f1-0f f2-0f down)
(adjacent f1-1f f1-0f left)
(adjacent f1-1f f1-2f right)
(adjacent f1-1f f0-1f up)
(adjacent f1-1f f2-1f down)
(adjacent f1-2f f1-1f left)
(adjacent f1-2f f1-3f right)
(adjacent f1-2f f0-2f up)
(adjacent f1-2f f2-2f down)
(adjacent f1-3f f1-2f left)
(adjacent f1-3f f1-4f right)
(adjacent f1-3f f0-3f up)
(adjacent f1-3f f2-3f down)
(adjacent f1-4f f1-3f left)
(adjacent f1-4f f0-4f up)
(adjacent f1-4f f2-4f down)
(adjacent f2-0f f2-1f right)
(adjacent f2-0f f1-0f up)
(adjacent f2-0f f3-0f down)
(adjacent f2-1f f2-0f left)
(adjacent f2-1f f2-2f right)
(adjacent f2-1f f1-1f up)
(adjacent f2-1f f3-1f down)
(adjacent f2-2f f2-1f left)
(adjacent f2-2f f2-3f right)
(adjacent f2-2f f1-2f up)
(adjacent f2-2f f3-2f down)
(adjacent f2-3f f2-2f left)
(adjacent f2-3f f2-4f right)
(adjacent f2-3f f1-3f up)
(adjacent f2-3f f3-3f down)
(adjacent f2-4f f2-3f left)
(adjacent f2-4f f1-4f up)
(adjacent f2-4f f3-4f down)
(adjacent f3-0f f3-1f right)
(adjacent f3-0f f2-0f up)
(adjacent f3-0f f4-0f down)
(adjacent f3-1f f3-0f left)
(adjacent f3-1f f3-2f right)
(adjacent f3-1f f2-1f up)
(adjacent f3-1f f4-1f down)
(adjacent f3-2f f3-1f left)
(adjacent f3-2f f3-3f right)
(adjacent f3-2f f2-2f up)
(adjacent f3-2f f4-2f down)
(adjacent f3-3f f3-2f left)
(adjacent f3-3f f3-4f right)
(adjacent f3-3f f2-3f up)
(adjacent f3-3f f4-3f down)
(adjacent f3-4f f3-3f left)
(adjacent f3-4f f2-4f up)
(adjacent f3-4f f4-4f down)
(adjacent f4-0f f4-1f right)
(adjacent f4-0f f3-0f up)
(adjacent f4-1f f4-0f left)
(adjacent f4-1f f4-2f right)
(adjacent f4-1f f3-1f up)
(adjacent f4-2f f4-1f left)
(adjacent f4-2f f4-3f right)
(adjacent f4-2f f3-2f up)
(adjacent f4-3f f4-2f left)
(adjacent f4-3f f4-4f right)
(adjacent f4-3f f3-3f up)
(adjacent f4-4f f4-3f left)
(adjacent f4-4f f3-4f up)
(at box0 f1-1f) 
(at box1 f3-2f) 
(clear f0-0f) 
(clear f0-1f) 
(clear f0-3f) 
(clear f0-4f) 
(clear f1-0f) 
(clear f1-2f) 
(clear f1-3f) 
(clear f1-4f) 
(at-robot f2-0f) 
(clear f2-0f) 
(clear f2-1f) 
(clear f2-2f) 
(clear f2-3f) 
(clear f2-4f) 
(clear f3-0f) 
(clear f3-1f) 
(clear f3-4f) 
(clear f4-0f) 
(clear f4-1f) 
(clear f4-2f) 
(clear f4-4f) 
)
(:goal
(and
(at box0 f3-4f) 
(at box1 f4-4f) 
)
)
)


;clearing memory:

; plan
1. (move f2-0f f1-0f up)
   deleted: (at-robot f2-0f)
   added: (at-robot f1-0f)
   goals met: 0 of 2
2. (push f1-0f f1-1f f1-2f right box0)
   deleted: (at-robot f1-0f) (at box0 f1-1f) (clear f1-2f)
   added: (at-robot f1-1f) (at box0 f1-2f) (clear f1-1f)
   goals met: 0 of 2
3. (move f1-1f f2-1f down)
   deleted: (at-robot f1-1f)
   added: (at-robot f2-1f)
   goals met: 0 of 2
4. (move f2-1f f3-1f down)
   deleted: (at-robot f2-1f)
   added: (at-robot f3-1f)
   goals met: 0 of 2
5. (move f3-1f f4-1f down)
   deleted: (at-robot f3-1f)
   added: (at-robot f4-1f)
   goals met: 0 of 2
6. (move f4-1f f4-2f right)
   deleted: (at-robot f4-1f)
   added: (at-robot f4-2f)
   goals met: 0 of 2
7. (push f4-2f f3-2f f2-2f up box1)
   deleted: (at-robot f4-2f) (at box1 f3-2f) (clear f2-2f)
   added: (at-robot f3-2f) (at box1 f2-2f) (clear f3-2f)
   goals met: 0 of 2
8. (move f3-2f f3-1f left)
   deleted: (at-robot f3-2f)
   added: (at-robot f3-1f)
   goals met: 0 of 2
9. (move f3-1f f2-1f up)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 0 of 2
10. (push f2-1f f2-2f f2-3f right box1)
   deleted: (at-robot f2-1f) (at box1 f2-2f) (clear f2-3f)
   added: (at-robot f2-2f) (at box1 f2-3f) (clear f2-2f)
   goals met: 0 of 2
11. (push f2-2f f2-3f f2-4f right box1)
   deleted: (at-robot f2-2f) (at box1 f2-3f) (clear f2-4f)
   added: (at-robot f2-3f) (at box1 f2-4f) (clear f2-3f)
   goals met: 0 of 2
12. (move f2-3f f1-3f up)
   deleted: (at-robot f2-3f)
   added: (at-robot f1-3f)
   goals met: 0 of 2
13. (move f1-3f f1-4f right)
   deleted: (at-robot f1-3f)
   added: (at-robot f1-4f)
   goals met: 0 of 2
14. (push f1-4f f2-4f f3-4f down box1)
   deleted: (at-robot f1-4f) (at box1 f2-4f) (clear f3-4f)
   added: (at-robot f2-4f) (at box1 f3-4f) (clear f2-4f)
   goals met: 0 of 2
15. (push f2-4f f3-4f f4-4f down box1)
   deleted: (at-robot f2-4f) (at box1 f3-4f) (clear f4-4f)
   added: (at-robot f3-4f) (at box1 f4-4f) (clear f3-4f)
   goals met: 1 of 2
16. (move f3-4f f2-4f up)
   deleted: (at-robot f3-4f)
   added: (at-robot f2-4f)
   goals met: 1 of 2
17. (move f2-4f f2-3f left)
   deleted: (at-robot f2-4f)
   added: (at-robot f2-3f)
   goals met: 1 of 2
18. (move f2-3f f2-2f left)
   deleted: (at-robot f2-3f)
   added: (at-robot f2-2f)
   goals met: 1 of 2
19. (move f2-2f f2-1f left)
   deleted: (at-robot f2-2f)
   added: (at-robot f2-1f)
   goals met: 1 of 2
20. (move f2-1f f1-1f up)
   deleted: (at-robot f2-1f)
   added: (at-robot f1-1f)
   goals met: 1 of 2
21. (push f1-1f f1-2f f1-3f right box0)
   deleted: (at-robot f1-1f) (at box0 f1-2f) (clear f1-3f)
   added: (at-robot f1-2f) (at box0 f1-3f) (clear f1-2f)
   goals met: 1 of 2
22. (push f1-2f f1-3f f1-4f right box0)
   deleted: (at-robot f1-2f) (at box0 f1-3f) (clear f1-4f)
   added: (at-robot f1-3f) (at box0 f1-4f) (clear f1-3f)
   goals met: 1 of 2
23. (move f1-3f f0-3f up)
   deleted: (at-robot f1-3f)
   added: (at-robot f0-3f)
   goals met: 1 of 2
24. (move f0-3f f0-4f right)
   deleted: (at-robot f0-3f)
   added: (at-robot f0-4f)
   goals met: 1 of 2
25. (push f0-4f f1-4f f2-4f down box0)
   deleted: (at-robot f0-4f) (at box0 f1-4f) (clear f2-4f)
   added: (at-robot f1-4f) (at box0 f2-4f) (clear f1-4f)
   goals met: 1 of 2
26. (push f1-4f f2-4f f3-4f down box0)
   deleted: (at-robot f1-4f) (at box0 f2-4f) (clear f3-4f)
   added: (at-robot f2-4f) (at box0 f3-4f) (clear f2-4f)
   goals met: 2 of 2
